XML/Public/PMSS02/request_pre/2022年3月1日/body_PMSS02_request_pre_20220301203706.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
 <out:in0><![CDATA[
<?xml version="1.0" encoding="utf-8"?>
<MBS>
  <pub>
    <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>zy333001</SRCBATCHNO>
    <TRANSCODE>PMSS02</TRANSCODE>
    <TRANSDATETIME>2021-04-13 10:54:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
    <head>
      <ALLAMOUNT>415</ALLAMOUNT>
      <ALLCOUNT>1</ALLCOUNT>
    </head>
    <list>
      <detail>
   <SRCSERIALNO>testPMSS02002</SRCSERIALNO>
    <SRCNOTECODE>test413002</SRCNOTECODE>
        <ORGCODE>001000</ORGCODE>
        <APPLYORGCODE>001000</APPLYORGCODE>
        <PAYDATE>2021-04-13 10:54:00</PAYDATE>
        <PAYTYPECODE>103</PAYTYPECODE>
        <SETTLEMENTMODECODE>101</SETTLEMENTMODECODE>
        <OURORGCODE>001000</OURORGCODE>
        <OURBANKACCOUNTNUMBER>1010101010</OURBANKACCOUNTNUMBER>
        <OURCURCODE>CNY</OURCURCODE>
        <OURAMOUNT>415</OURAMOUNT>
        <ISURGENT>0</ISURGENT>
        <OPPBANKACCOUNTNAME>张三</OPPBANKACCOUNTNAME>
        <OPPBANKACCOUNTNUMBER>3958035938459874</OPPBANKACCOUNTNUMBER>
        <OPPOBJECTNAME>张三</OPPOBJECTNAME>
        <OPPOBJECTCODE>000001</OPPOBJECTCODE>
        <OPPBANKLOCATIONCODE>302491065032</OPPBANKLOCATIONCODE>
        <OPPBANKLOCATIONS>中信银行股份有限公司登封支行</OPPBANKLOCATIONS>
        <OPPDIRECTCURCODE>CNY</OPPDIRECTCURCODE>
        <OPPPRIVATEFLAG>1</OPPPRIVATEFLAG>
        <PURPOSE></PURPOSE>
        <DUPLNOTECODE></DUPLNOTECODE>
        <ISOUTOFBUDGET>1</ISOUTOFBUDGET>
        <EXTERNALACCESSORIES></EXTERNALACCESSORIES>
             <BUDGETITEMCODE></BUDGETITEMCODE>
             <PROJECTITEMCODE></PROJECTITEMCODE>
             <CONTRACTCODE></CONTRACTCODE>
             <CAPITALCATEGORYCODE></CAPITALCATEGORYCODE>
             <CASHFLOWITEMCODE></CASHFLOWITEMCODE>
             <MEMO></MEMO>
             <TAXAMOUNT></TAXAMOUNT>
             <TAXRATE></TAXRATE>
             <AMOUNT>415</AMOUNT>
      </detail>
    </list>
  </req>
</MBS>
       ]]>
    </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>